scorebook-api/app/controllers/games_controller.rb

    def create
        game = Game.create!(games_params)
---
INSERT INTO "games" ("home_team_id", "away_team_id", "home_team_runs", "away_team_runs", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["home_team_id", 1], ["away_team_id", 2], ["home_team_runs", 6], ["away_team_runs", 3], ["created_at", "2020-04-29 13:38:45.874116"], ["updated_at", "2020-04-29 13:38:45.874116"]]