scorebook-api/app/controllers/players_controller.rb

UPDATE "players" SET "name" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["name", "Beni"], ["updated_at", "2020-04-25 03:58:29.891484"], ["id", 1]]
---
    def update
        set_player
        @player.update(players_params)