scorebook-api/app/controllers/teams_controller.rb

    def index
        teams = Team.all
---
SELECT "teams".* FROM "teams"