app/models/game.rb

SELECT "teams".* FROM "teams" WHERE "teams"."name" = $1 LIMIT $2  [["name", "Boston Red Sox"], ["LIMIT", 1]]
---
    def home_team_attributes=(home_team)
        self.home_team = Team.find_by(name: home_team[:name])

SELECT "teams".* FROM "teams" WHERE "teams"."name" = $1 LIMIT $2  [["name", "New York Yankees"], ["LIMIT", 1]]
---
    def away_team_attributes=(away_team)
        self.away_team = Team.find_by(name: away_team[:name])